---
title: Заметки по книге - Си
tags: [books, c]
reference:

---

* TOC 
{:toc}

# Глава 1. Вводный курс

<pre><code class="c">#include <stdio.h\>

int main (){
    printf("hello, world!\n");
    return 0;
}

avis@avis-PC[23:47:16]:~/develop/doc/learn/books/c$ cc hello.c
avis@avis-PC[23:47:23]:~/develop/doc/learn/books/c$ ./a.out 
hello, world!
</code></pre>

<pre><code class="c">#include <stdio.h\>

// Вывод таблицы температур по Фаренгейту и Цельсию

int main (){
    float fahr, celsius;
    int lower, upper, step;

    lower = 0;      // нижняя граница температур
    upper = 300;    // верняя граница температур
    step = 20;      // величина шага

    while ( fahr <= upper ){
        celsius = (5.0/9.0) * (fahr - 32.0); // c = (5/9)(f - 32)
        printf("%3.0f %6.2f\n", fahr, celsius);
        fahr = fahr + step;
    }

    return 0;
}
$ ./a.out 
  0 -17.78
 20  -6.67
 40   4.44
 60  15.56
 80  26.67
100  37.78
120  48.89
140  60.00
160  71.11
180  82.22
200  93.33
220 104.44
240 115.56
260 126.67
280 137.78
300 148.89
</code></pre>

* %3.0f - вывести вещественое число в поле шириной не менее 3 символа без десятичной части
* %6.2f - вывести вещественое число в поле шириной не менее 6 символа и вывод двух цифр после точки

Упражнение 1.3. Модифицируйте программу преобразования температур так, чтобы она выводила заголовок над таблицей.

<pre><code class="c">
int main (){
    float fahr, celsius;
    int lower, upper, step;

    lower = 0;      // нижняя граница температур
    upper = 300;    // верняя граница температур
    step = 20;      // величина шага

    printf("%s  %s\n", "Фаренгейт", "Цельсию");

    while ( fahr <= upper ){
        celsius = (5.0/9.0) * (fahr - 32.0); // c = (5/9)(f - 32)
        printf("%9.0f %6.2f\n", fahr, celsius);
        fahr = fahr + step;
    }

    return 0;
}

Фаренгейт  Цельсию
        0 -17.78
       20  -6.67
       40   4.44
</code></pre>

Упражнение 1.4. Напишите программу для перевода температур по Цельсию в шкалу Фаренгейта и вывода соответсвующей таблицы

<pre><code class="c">int main (){
    float fahr, celsius = 0;
    int lower, upper, step;

    lower = 0;      // нижняя граница температур
    upper = 100;    // верняя граница температур
    step = 20;      // величина шага

    while ( celsius <= upper ){
        fahr = (celsius * (9.0/5.0)) + 32;
        printf("%3.0f %6.2f\n", celsius, fahr);
        celsius += step;
    }

    return 0;
}

  0  32.00
 20  68.00
 40 104.00
 60 140.00
 80 176.00
100 212.00
</code></pre>

<pre><code class="c">// Вывод таблицы температур по Фаренгейту и Цельсию (v2)

int main (){
    float fahr;

    for ( fahr = 0; fahr <= 300; fahr += 20 )
        printf("%3.0f %6.2f\n", fahr, (5.0/9.0)*(fahr-32));

    return 0;
}

  0 -17.78
 20  -6.67
 40   4.44
 60  15.56
 80  26.67
100  37.78
</code></pre>

Упражнение 1.5. Доработайте программу преобразования температур так, чтобы она выводила таблицу в обратном порядке, т.е. от 300 градусов до нуля

<pre><code class="c">// Вывод таблицы температур по Фаренгейту и Цельсию (v3)

int main (){
    float fahr;

    for ( fahr = 300; fahr >= 0; fahr -= 20 )
        printf("%3.0f %6.2f\n", fahr, (5.0/9.0)*(fahr-32));

    return 0;
}

300 148.89
280 137.78
260 126.67
240 115.56
220 104.44
200  93.33
</code></pre>

<pre><code class="c">#define LOWER 0
#define UPPER 300
#define STEP 20

// Вывод таблицы температур по Фаренгейту и Цельсию (v4)

int main (){
    float fahr;

    for ( fahr = LOWER; fahr <= UPPER; fahr += STEP )
        printf("%3.0f %6.2f\n", fahr, (5.0/9.0)*(fahr-32));

    return 0;
}

  0 -17.78
 20  -6.67
 40   4.44
 60  15.56
 80  26.67
100  37.78
</code></pre>

## 1.5.1 Копирование файлов (?)

<pre><code class="с">// копирование входного потока в выходной

int main(){
    char c;
    
    while ( (c = getchar()) != EOF )
        putchar(c);

    return 0;
}

$ ./a.out 
1
1
2
2
g
g

</code></pre>

Упражнение 1.6. Проверьте, что выражение getchar() != EOF действительно равно 1 или 0;

<pre><code class="c">    
    while ( (c = getchar()) != EOF ){
        printf("%d\n", getchar() != EOF);
        putchar(c);
    }
$ ./a.out 
e
1
eq
1
qd
1

</code></pre>

PS. В конце файла EOF будет 1 т.е. true

Упражнение 1.7. Напишите программу вывода значения константы EOF

<pre><code class="c">int main(){
    printf("%d\n", EOF);
    printf("%d\n", getchar());
    return 0;
}

$ ./a.out 
-1
1
49
</code></pre>

## 1.5.2 Подсчет символов

<pre><code class="c">// подсчет кол-ва символов в входном потоке

int main(){

    long count = 0;
    while ( getchar() != EOF )
        ++count;
    printf("%ld", count);

    return 0;
}

$ ./a.out 
1
2
3
4
</code></pre>

PS символ перевода строки тоже считается

## 1.5.2 Подсчет строк

<pre><code class="perl">// подсчет кол-ва строк в входном потоке

int main(){

    long count = 0;
    char c;

    while ( (c = getchar()) != EOF )
        if ( c == '\n' )
            ++count;

    printf("%ld\n", count);

    return 0;
}

$ ./a.out 
hello 
world
2
</code></pre>

Упражнение 1.8. Напишите программу для подчета пробелов, знаков табуляции и символов конца строки

<pre><code class="c">// подсчет кол-ва пробелов, знаков табуляции и символов конца строки

int main(){

    long count_spaces = 0, count_tabs = 0, count_endstr = 0;
    char c;

    while ( (c = getchar()) != EOF )
        if ( c == ' ' ){
            ++count_spaces;
        } else if ( c == '\t' ){
            ++count_tabs;
        } else if ( c == '\0' ){
            ++count_endstr;
        }

    printf("Кол-во пробелов = %ld; Кол-во табуляций = %ld; Кол-во символов конца строки = %ld\n", count_spaces, count_tabs, count_endstr);

    return 0;
}

$ ./a.out 
dsa
    
e
 
 dsa
Кол-во пробелов = 2; Кол-во табуляций = 1; Кол-во символов конца строки 0
</code></pre>

Упражнение 1.9. Напишите программу для копирования входноо потока в выходной с заменой строки состоящей из одного или нескольких пробелов, одним пробелом

<pre><code class="c">int main(){

    int is_last_char_space = 0;
    char c;
    while ( (c = getchar()) != EOF ){
        if ( c == ' ' ){
            if ( !is_last_char_space ) putchar(' ');
            is_last_char_space = 1;
        } else {
            putchar(c);
            is_last_char_space = 0;
        }
    }

    return 0;
}

$ ./a.out 
help   mee   
help mee 
help mee   mm  ee  
help mee mm ee 
</code></pre>